# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'thoughtbot/formulae'
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Settings
cask_args appdir: '/Applications'

# Libs
brew "openssl"
brew 'coreutils'
brew 'md5sha1sum'
brew "ctags"
brew "libxml2"
brew 'libpng'
brew 'freetype'
brew 'ffmpeg'
brew 'readline'
brew 'libogg'
brew 'libvorbis'

# UNIX Tools
brew 'git'
brew "tmux"
brew "vim"
brew "rcm" ## management suite for dotfiles
brew "the_silver_searcher" ## code searching (similar to grep)
brew "curl"
brew "wget"
brew 'pigz' ## parallel gzip compression
brew 'grep'
brew 'tree'
brew 'tor'
brew 'diff-so-fancy' ## human readable diff
brew 'gnupg' ## encrypt and sign
brew 'gnupg2' ## encrypt and sign
brew 'parallel'

# Docker
brew 'docker'

# Programming languages
brew "libyaml" # should come after openssl
brew "go"
brew "rbenv"
brew "ruby-build"
brew "rbenv-default-gems"

# Databases
brew "postgres", restart_service: true
brew "mysql", restart_service: true

# Mac Stuff
brew 'mas' ## command line interface for AppStore
brew 'm-cli'

# Cask Fonts
cask 'font-source-code-pro'
cask 'font-inconsolata'
cask 'font-ubuntu'
cask 'font-source-sans-pro'

# Apps
cask 'appcleaner'
cask 'dropbox'
cask 'duet' ## use ipad as screen
cask 'docker'
cask 'gpgtools' ## encrypt, decrypt, sign and verify mails using OpenPGP
cask 'istat-menus' ## monitor system from menubar
cask 'postgres'
cask 'suspicious-package' ## see inside an installer package
cask 'slack'
cask 'github-desktop'
cask 'xquartz'
cask 'virtualbox'
cask 'silverlight'
cask 'the-unarchiver'
cask 'firefox'
cask 'google-chrome'
cask 'atom'
cask 'macdown' ## markdown editor for Mac
cask 'java'
cask 'skype'
cask 'iboostup' ## improve Mac performance
cask 'imageoptim' ## omptimise images for web
cask 'vlc'
cask 'tunnelbear' ## VPN
